from pathlib import Path

import clize

from core.customer import Customer
from outlook import run_download


def order():
    ''' Заказывает выписки из ЕГРН '''
    print("Процедура заказа выписок запущена...")
    c = Customer("Opera")
    try:
        c.run_order()
    except Exception as e:
        print(str(e))
        print("Что-то пошло не так... "
              "\nСкорее всего проблемы на стороне Росреестра или может Вы забыли закрыть Opera"
              "\nПовторите попытку, не забыв перейти в браузере на первый шаг.")
    else:
        print("Заказ сделан")


def download(target_dir=Path.home() / "Desktop/extracts-downloaded"):
    '''
    Скачивает выписки, ссылки на которые содержатся в непрочитанных сообщениях Росреестра, пришедших в Outlook.

    Перед запуском откройте Outlook и перейдите в папку с сообщениями Росреестра.

    Бот поддерживает только выписки, сведения о которых пришли на почту с темой «Уведомление о завершении обработки запроса».

    :param target_dir: Путь к каталогу, в который необходимо сохранить скачанные выписки. 
	По умолчанию выписки будут скачаны на рабочий стол
    '''

    print("""Перед запуском откройте Outlook и перейдите в папку с сообщениями Росреестра.
Бот поддерживает только выписки, сведения о которых пришли 
на почту с темой: «Уведомление о завершении обработки запроса».

Некоторые выписки в таком виде не приходят, поэтому качайте их самостоятельно.
Такие выписки, по моим наблюдениям, имеют странное расширение xml.original  
    """)
    print("Скачивание началось...\n")
    try:
        run_download(target_dir)
    except Exception as e:
        print(str(e))
        print("Что-то пошло не так. \nВозможно Вы забыли открыть Outlook в папке с сообщениями Росреестра.")
    else:
        print("Скачивание завершено.")


if __name__ == '__main__':
    descr = """
    Утилита для автоматизации заказа и скачивания выписок из ЕГРН
    """
    clize.run([download, order], description=descr)
